БухЭксп/Catalogs/CW_ДоговорыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоговорыПоГрузоперевозкам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШаблонПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьАкты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодставлятьПодписиИПечатьПриЭлектроннойРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриложенияВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиАктов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиАктов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШаблоныУслуг</Name>
			<Comment>Шаблоны услуг для подстановки в документы клиентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнглийский</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор либо приложение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НастройкаЗависмыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НастройкаЗависмыхУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоговорыПоГрузоперевозкам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.СогласованиеОбъктов
	CW_СогласованиеСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СогласованиеОбъктов
	
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	CW_ГруппыУслугСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	CW_ДополнительныеХарактиристикиДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ОригиналыДокументов
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	ВедениеБухгалтескогоУчетаМСФО 			= ПолучитьФункциональнуюОпцию("CW_ВедениеБухгалтескогоУчетаМСФО");
	ВалютаРегламентированногоУчетаРубль 	= ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	РедактированиеЗапрещено_ШаблоныУслуг 	= РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено("РегистрСведений.CW_ШаблоныУслуг");
	
	Если Не ВалютаРегламентированногоУчетаРубль или ВедениеБухгалтескогоУчетаМСФО Тогда
		Элементы.ВидДоговора.СписокВыбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	КонецЕсли;
	
	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
	Если Параметры.Ключ.Пустая() Тогда
		ДатаДоговора = ТекущаяДата();
		
		Если Объект.Организация.Пустая() Тогда
			Объект.Организация = CW_Настройки.ОсновнаяОрганизация();
		КонецЕсли; 
		
		Объект.БухгалтерскийУчет = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"УстанавливатьДляНовыхДоговоровБУ");;
		
	КонецЕсли; 
	
	Если  ПолучитьФункциональнуюОпцию("CW_ИспользуютсяЗависимыеУслуги") Тогда
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			ИспользуютсяЗависимыеУслуги		= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам");
			ЗависимыеУслугиУчитыватьГруз	= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим");
		ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			ИспользуютсяЗависимыеУслуги		= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам");
			ЗависимыеУслугиУчитыватьГруз	= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьГрузПоВходящим");
			ЗависимыеУслугиУчитыватьКлиентаПоВходящим 	= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим");
		КонецЕсли;
	КонецЕсли;

	ОграничиватьУслугиПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
	Если ОграничиватьУслугиПоДоговорам Тогда
		ПолучитьРазрешениеНаредактированиеУслугПоТипуДоговора();
	КонецЕсли;
	
	СписокЗависимыхУслуг.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	
	СпособРедактированияНаименования =  ?(Объект.РедактироватьНаименование,1,0);
	
	_УФС.ВключитьКлассическийВидЭлементаФормы(Элементы.ВидДоговора);
	_УФС.ВключитьКлассическийВидЭлементаФормы(Элементы.ВалютаДоговора);
	_УФС.ВключитьКлассическийВидЭлементаФормы(Элементы.Организация);
	          
	_УправлениеЭлементамиФормы();
	
	// контроль для разрешения изменения реквизитов
	ЕстьПроведенныеДокументы = ЕстьПроведенныеДокументыПоДоговору(Объект.Ссылка);		
	
	РедактированиеЗапрещено	= РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам"));

	Если РедактированиеЗапрещено Тогда
		
		ЭтаФорма.ТолькоПросмотр 						= Истина;
		Элементы.ПараметрыДоговора.ТолькоПросмотр 		= Истина;
		Элементы.ДокументыДоходов.ТолькоПросмотр 		= Истина;
		Элементы.ДокументыРасходов.ТолькоПросмотр 		= Истина;
		Элементы.ШаблоныУслуг.ТолькоПросмотр 			= Истина;
		
		Элементы.ПараметрыДоговораКнопкаИзменить.Доступность 	= Ложь;
		Элементы.ДокументыДоходовКнопка2.Доступность 			= Ложь;
		Элементы.ДокументыРасходовКнопка2.Доступность 			= Ложь;
		Элементы.ШаблоныУслугКнопка4.Доступность 				= Ложь;
		
		Элементы.СпособРедактированияНаименования.Доступность = Ложь;
	КонецЕсли; 
	
	ТекущийУчетныйДоговор = Объект.УчетныйДоговор;
	
	ОтображатьТипДоговора = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ОтображатьТипДоговора");
	Элементы.ТипДоговора.Видимость = ОтображатьТипДоговора;
	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	CW_ГруппыУслугСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	CW_ДополнительныеХарактиристикиДоговоровСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.УчетПриложенийДоговоров
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов

КонецПроцедуры


// Выполняет проверку наличия проведенных документов по договору
&НаСервереБезКонтекста
Функция ЕстьПроведенныеДокументыПоДоговору(ТекущаяСсылка)
	
	Если не ЗначениеЗаполнено(ТекущаяСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ДокументыПоДоговорамИПриложениям.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.CW_ДокументыПоДоговорамИПриложениям(&Договор) КАК CW_ДокументыПоДоговорамИПриложениям
	|ГДЕ
	|	CW_ДокументыПоДоговорамИПриложениям.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Договор", ТекущаяСсылка);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();	
	
КонецФункции





&НаСервере
Процедура ПолучитьРазрешениеНаредактированиеУслугПоТипуДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		РазрешеноРедактированиеУслуг = Ложь;
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		РазрешеноРедактированиеУслуг 	= CW_ПраваДоступа.ПравоДоступно("РедактироватьУслугиПоВходящимДоговорам");
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		РазрешеноРедактированиеУслуг 	= CW_ПраваДоступа.ПравоДоступно("РедактироватьУслугиПоИсходящимДоговорам");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	_УправлениеЭлементамиФормы();
	УстановитьОтборДинамическихСписков();
	
	Если КомментарийИзменен Тогда
		КомментарийИзменен = Ложь;
		Оповестить("ОбновитьКоментарийДоговораНаФрме");
	Конецесли;
	
	Оповестить("ОбновитьАдресУслугДоговора");
	
КонецПроцедуры


&НаСервере
Процедура _УправлениеЭлементамиФормы()

	Если Объект.ВалютаДоговора = БазоваяВалюта Тогда
		Элементы.ВзаиморасчетыВУЕ.Видимость = Ложь;
	Иначе
		Элементы.ВзаиморасчетыВУЕ.Видимость = Истина;
	КонецЕсли; 	
	
	Элементы.Наименование.ТолькоПросмотр = (НЕ Объект.РедактироватьНаименование);
	
	Элементы.ГруппаУчетныйДоговор.Видимость 				=  Объект.БухгалтерскийУчет;
	Элементы.УчетныйДоговор.Видимость 						=  Объект.БухгалтерскийУчет;
	Элементы.СоздатьУчетныйДоговор.Видимость 				=  Объект.БухгалтерскийУчет;
	Элементы.НадписьСлужебныеДоговора.Видимость 			=  Объект.БухгалтерскийУчет; 
	Элементы.ДатаНачалаВеденияБухгалтерскогоУчета.Видимость =  Объект.БухгалтерскийУчет; 
	
	ВидимостьЗакладок = (НЕ Объект.Ссылка.Пустая());   
	
	ПросмотрРасходов 			= CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Расходы");
	ПросмотрДоходов 			= CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы");
	
	Элементы.СтраницаПараметры.Видимость				= ВидимостьЗакладок;
	Элементы.СтраницаДокументыДоходов.Видимость			= ВидимостьЗакладок И Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем и ПросмотрДоходов;
	Элементы.СтраницаДокументыРасходов.Видимость		= ВидимостьЗакладок И Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком и ПросмотрРасходов;
	Элементы.СтраницаШаблоныУслуг.Видимость				= ВидимостьЗакладок;
	Элементы.СтраницаНоменклатураПоДоговору.Видимость	= ВидимостьЗакладок;
	
	ОграничиватьНоменклатуруПриИзмененииНаСервере();
	
	Если ОграничиватьУслугиПоДоговорам Тогда
		Элементы.ОграничиватьНоменклатуру.Доступность 		= РазрешеноРедактированиеУслуг;
		Элементы.УстановкаУслугПоДоговору.ТолькоПросмотр 	= Не РазрешеноРедактированиеУслуг;
	КонецЕсли;


	Если ДоговорДляОтбора.Пустая() Тогда
		
		Если ВидимостьЗакладок Тогда
			
			ДоговорДляОтбора = Объект.Ссылка;
			ПараметрыДоговора.Параметры.УстановитьЗначениеПараметра("Договор",ДоговорДляОтбора);
			_УФС.ДобавитьОтбор(ПараметрыДоговора.Отбор,"Договор",,ДоговорДляОтбора);
            Элементы.ПараметрыДоговора.Обновить();
			
			ШаблоныУслуг.Отбор.Элементы.Очистить();
			_УФС.ДобавитьОтбор(ШаблоныУслуг.Отбор,"Договор",,ДоговорДляОтбора);
			_УФС.ДобавитьОтбор(ШаблоныУслуг.Отбор,"ПриложениеКДоговору",,ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"));

			Если Объект.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
				
				ДокументыРасходов.Параметры.УстановитьЗначениеПараметра("Договор",ДоговорДляОтбора);
				Элементы.ДокументыРасходов.Обновить();
				Элементы.СтраницаДокументыРасходов.Видимость = Истина;
				// --- 
				_УФС.ДобавитьОтбор(ШаблоныУслуг.Отбор,"РасходнаяСтатья",,Истина);
				Элементы.ШаблоныУслуг.Обновить();
				
			Иначе
				
				ДокументыДоходов.Параметры.УстановитьЗначениеПараметра("Договор",ДоговорДляОтбора);
				Элементы.ДокументыДоходов.Обновить();
				Элементы.СтраницаДокументыДоходов.Видимость = Истина;
				// --- 
				_УФС.ДобавитьОтбор(ШаблоныУслуг.Отбор,"ДоходнаяСтатья",,Истина);
				Элементы.ШаблоныУслуг.Обновить();
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Элементы.СписокЗависимыхУслуг.Видимость = ИспользуютсяЗависимыеУслуги;
	
	Элементы.ШаблоныУслуг.ТолькоПросмотр 				= РедактированиеЗапрещено_ШаблоныУслуг;
	Элементы.ШаблоныУслугКоманднаяПанель.Доступность 	= НЕ РедактированиеЗапрещено_ШаблоныУслуг;
	
	УстановитьОтборДинамическихСписков();
	
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	Элементы.ИспользуетсяОграниченияПоГруппамУслуг.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"); 
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	УстановкаУслугПоДоговору.Параметры.УстановитьЗначениеПараметра("Договор"	, Объект.Ссылка);
	УстановкаУслугПоДоговору.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	УстановкаУслугПоДоговору.Параметры.УстановитьЗначениеПараметра("ПустаяДата"	, Дата(1,1,1));
	
КонецПроцедуры
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СоздатьУчетныйДоговор(Команда)
	
	Если НЕ Объект.УчетныйДоговор.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Договор уже создан!");
		Возврат;
		
	КонецЕсли; 
	
	// проверяем заполненные поля
	
	Если Объект.Организация.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не задана организация.");
		Возврат;
		
	КонецЕсли; 
	
	Если Объект.Владелец.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не задан контрагент.");
		Возврат;
		
	КонецЕсли;

	Если СокрЛП(Объект.НомерДоговора)="" Тогда
		
		_УФК.ВывестиПредупреждение("Не задан номер.");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ДатаДоговора=Дата(1,1,1) Тогда
		
		_УФК.ВывестиПредупреждение("Не задана дата договора.");
		Возврат;
		
	КонецЕсли;

	Если Объект.ВидДоговора.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не задан вид договора.");
		Возврат;
		
	КонецЕсли;
	
	// --- 
	
	_СоздатьУчетныйДоговор();
	
КонецПроцедуры

&НаСервере
Процедура _СоздатьУчетныйДоговор()
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ ПЕРВЫЕ 1
	              	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	              	|ИЗ
	              	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	              	|ГДЕ
	              	|	ДоговорыКонтрагентов.Организация = &Организация
	              	|	И ДоговорыКонтрагентов.Номер = &Номер
	              	|	И ДоговорыКонтрагентов.Дата = &Дата
	              	|	И ДоговорыКонтрагентов.Владелец = &Владелец
	              	|	И ДоговорыКонтрагентов.ВидДоговора = &Вид
	              	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	              	|	И ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах = &РасчетыВУсловныхЕдиницах"; 
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);  
	Запрос.УстановитьПараметр("Номер",		 Объект.НомерДоговора); 
	Запрос.УстановитьПараметр("Дата",	  	 Объект.ДатаДоговора); 
	Запрос.УстановитьПараметр("Владелец",	 Объект.Владелец); 
	Запрос.УстановитьПараметр("Вид",		 Объект.ВидДоговора); 
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", 		Объект.ВалютаДоговора);
	Запрос.УстановитьПараметр("РасчетыВУсловныхЕдиницах", 	Объект.ВзаиморасчетыВУЕ);
	
	//Для версии КОРП 
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	Если ЭтоВерсияКОРП Тогда
		//Ищем по головной организации
		Запрос.УстановитьПараметр("Организация", Объект.Организация.ГоловнаяОрганизация); 
	КонецЕсли;
	//Для версии КОРП
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		УчетныйДоговор = Выборка.Ссылка; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетныйДоговор) Тогда
		
		Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент(); 
		
		СтрокаРеквизитов = "Наименование,Владелец,Организация,Номер:НомерДоговора,Дата:ДатаДоговора,ВидДоговора,ВалютаВзаиморасчетов:ВалютаДоговора,РасчетыВУсловныхЕдиницах:ВзаиморасчетыВУЕ";
		_сф.ст_ЗаполнитьСвойства(Договор,СтрокаРеквизитов,Объект);

		//Для версии КОРП 
		Если ЭтоВерсияКОРП Тогда
			Договор.Организация = Объект.Организация.ГоловнаяОрганизация;  
		КонецЕсли;
		//Для версии КОРП 
		
		Договор.СпособЗаполненияСтавкиНДС 	= ПредопределенноеЗначение("Перечисление.СпособыЗаполненияСтавкиНДС.Автоматически");
		Договор.СпособВыставленияДокументов = ПредопределенноеЗначение("Перечисление.СпособыВыставленияДокументов.Автоматически");
		
		Договор.Записать(); 
		
		УчетныйДоговор = Договор.Ссылка;
		
	КонецЕсли;   
	
	Объект.УчетныйДоговор = УчетныйДоговор;	
	ТекущийУчетныйДоговор = УчетныйДоговор;

КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОтсутствующиеОригиналы(Команда)
	
	ОткрытьФорму("Отчет.CW_ОтсутствующиеОригиналыДокументов.Форма.ФормаОтчетаУправляемая",_ПараметрыФормыОтчетаПоКонтролюОригиналов(),,Истина,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьОтчетОтсутствующиеОригиналыДокументов()

	//об = Отчеты.CW_ОтсутствующиеОригиналыДокументов.Создать();
	//ф = об.ПолучитьФорму();
	//ф.ЭтоРасшифровка = Истина;
	//ф.ОтчетИнициализация();
	//ф.УстановитьОтбор("Договор", Объект.Ссылка);
	//ф.Открыть();
	//ф.ОтчетВывести();
		
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыОтчетаПоКонтролюОригиналов()
	// --- 
	
	ПФ = Новый Структура;
	ПФ.Вставить("ВнешнийВызов", Истина);
	ПФ.Вставить("Параметры", Новый Структура("НаДату,Входящие,Исходящие",ТекущаяДата(),Истина,Истина));
	ПФ.Вставить("Отбор",Новый Структура("Договор", Объект.Ссылка));
	
	Возврат(ПФ);
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура АктСверки(Команда)
	
	ПФ = Новый Структура;
	ПФ.Вставить("НачалоПериода",НачалоГода(ТекущаяДата()));
	ПФ.Вставить("КонецПериода",КонецДня(ТекущаяДата()));
	ПФ.Вставить("Контрагент",Объект.Владелец);
	ПФ.Вставить("Договор", Объект.Ссылка);
	
	ОткрытьФорму("Отчет.CW_АктСверкиВзаиморасчетов.Форма.ФормаОтчета",ПФ);
	
КонецПроцедуры


&НаКлиенте
Процедура ВалютаДоговораПриИзменении(Элемент)
	
	Если Объект.ВалютаДоговора = БазоваяВалюта Тогда
		
		Объект.ВзаиморасчетыВУЕ = Ложь;
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СпособРедактированияНаименованияПриИзменении(Элемент)
	
	Объект.РедактироватьНаименование = СпособРедактированияНаименования = 1;
	
	Если (НЕ Объект.РедактироватьНаименование) Тогда
		
		// формируем стандартное наименование
		СформироватьНаименование();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Если СпособРедактированияНаименования = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента 	= ПолучитьКраткоеНаименование(Объект.ВидДокумента);
	Номер 			= ?(ЗначениеЗаполнено(Объект.НомерДоговора), " №" + СокрЛП(Объект.НомерДоговора), "");
	Дата 			= ?(ЗначениеЗаполнено(Объект.ДатаДоговора), " от "+ Формат(Объект.ДатаДоговора,"ДФ=dd.MM.yyyy"), "");
	
	ШаблонПредставления = "[ВидДокумента][Номер][Дата]";
	
	СтрПредставление = СтрЗаменить(ШаблонПредставления, "[ВидДокумента]", 	ВидДокумента);
	СтрПредставление = СтрЗаменить(СтрПредставление, 	"[Номер]", 			Номер);
	СтрПредставление = СтрЗаменить(СтрПредставление, 	"[Дата]", 			Дата);
	
	Объект.Наименование = СтрПредставление;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКраткоеНаименование(ВидДокумента)
	
	Возврат СокрЛП(ВидДокумента.КраткоеНаименование);
	
КонецФункции

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоговораПриИзменении(Элемент)
	
	////Подсистема.НумерацияДоговоровИПриложений
	//Если ЕстьАвтоматическаяНумерацияДоговоров() Тогда
	//	CW_НумерацияДоговоровИПриложенийКлиент.ОбновитьНомерОбъкта(ЭтаФорма, "CW_ДоговорыПоГрузоперевозкам", "НомерДоговора");
	//КонецЕсли;
	////Подсистема.НумерацияДоговоровИПриложений
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьАвтоматическаяНумерацияДоговоров()
	Возврат  ПолучитьФункциональнуюОпцию("CW_АвтоматическаяНумерацияДоговоровСПокупателями");
КонецФункции

&НаКлиенте
Процедура БухгалтерскийУчетПриИзменении(Элемент)
	
	Если Не Объект.БухгалтерскийУчет Тогда
		// при наличии проведенных документов по договору не позволяем отменить БУ
		Если ЕстьПроведенныеДокументыПоДоговору(Объект.Ссылка) Тогда 
			Объект.БухгалтерскийУчет = НЕ Объект.БухгалтерскийУчет;
			ПоказатьПредупреждение(	, "По договору есть проведённые документы. 
			|Изменять признак ведения бухгалтерского учёта запрещено!"	);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	_БухгалтерскийУчетПриИзменении();
	
КонецПроцедуры

&НаСервере
Функция _БухгалтерскийУчетПриИзменении()
	
	_УправлениеЭлементамиФормы();
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов

	//Подсистема.ДополнительныеХарактиристикиДоговоров
	CW_ДополнительныеХарактиристикиДоговоровСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
	ЕстьПроведенныеДокументы = ЕстьПроведенныеДокументыПоДоговору(Объект.Ссылка);		

	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ЕстьПроведенныеДокументы",ЕстьПроведенныеДокументы);
	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ПроверитьУчетныйДоговор",ПроверитьУчетныйДоговор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УчетныйДоговорНачалоВыбораНаСервере(ТекущаяСсылка)

	Возврат ЕстьПроведенныеДокументыПоДоговору(ТекущаяСсылка); 
	
КонецФункции


&НаКлиенте
Процедура УчетныйДоговорПриИзменении(Элемент)   
	
	Если УчетныйДоговорНачалоВыбораНаСервере(Объект.Ссылка) Тогда  
		ПоказатьПредупреждение(Неопределено, "Внимание!
										    |По договору есть проведенные документы. Изменение учетного договора может потребовать их перепроведение!");
	КонецЕсли;
	
	ПроверитьУчетныйДоговор 	= ТекущийУчетныйДоговор <> Объект.УчетныйДоговор;
	ТекущийУчетныйДоговор 		= Объект.УчетныйДоговор;  
	
КонецПроцедуры
 
&НаСервере
Процедура ОграничиватьНоменклатуруПриИзмененииНаСервере()
	
	Элементы.СтраницаНоменклатураПоДоговору.Видимость = Объект.ОграничиватьНоменклатуру;
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьНоменклатуруПриИзменении(Элемент)
	ОграничиватьНоменклатуруПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаУслугПоДоговоруПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		Если Не Копирование Тогда 
			
			Отказ = истина; 
			
			//открываем форму с парметрами только в случае если не используется копирование документа.
			ЗначенияЗаполнения 	= новый Структура;
			ЗначенияЗаполнения.Вставить("Организация", 		Объект.Организация);
			ЗначенияЗаполнения.Вставить("Контрагент", 		Объект.Владелец);
			ЗначенияЗаполнения.Вставить("Договор", 			Объект.Ссылка);
			ЗначенияЗаполнения.Вставить("ВалютаДокумента", 	Объект.ВалютаДоговора);
			
			ПараметрыФормы = новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
			ОткрытьФорму("Документ.CW_УслугиПоДоговоруГрузоперевозки.ФормаОбъекта", ПараметрыФормы, Этаформа,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	Иначе
		
		Отказ = истина;
		ПоказатьПредупреждение(,"Договор нужно записать!");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокУслугПоПротоколу" Тогда
		
		УстановитьОтборДинамическихСписков();
		Элементы.УстановкаУслугПоДоговору.Обновить();
		
		//Подсистема.УчетПриложенийДоговоров
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеДополнительныхСоглашений" Тогда
		
		CW_УчетПриложенийДоговоровКлиентСервер.ОбновитьНаличиеДополнительныхСоглашений(ЭтаФорма);
		//Подсистема.УчетПриложенийДоговоров
		
		//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
		
	ИначеЕсли ИмяСобытия ="ЗаписьПриложенияДоговора" и  Параметр = Объект.Ссылка Тогда
		
		CW_УчетПриложенийДоговоровКлиентСервер.ОбновитьНаличиеДополнительныхСоглашений(ЭтаФорма);
		
		//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
		//Подсистема.СтатусыДокументов  
		
		//Подсистема.СогласованиеОбъктов 
	ИначеЕсли ИмяСобытия = "Изменение_СогласованиеОбъектов" Тогда
		
		  CW_СогласованиеКлиент.ОбновитьСтатусОбъекта(Истина, ЭтаФорма);
		//Подсистема.СогласованиеОбъктов
		
	КонецЕсли;

КонецПроцедуры

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	Элементы.ПриложенияДоговора.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ПолучитьРазрешениеНаредактированиеУслугПоТипуДоговора();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗависимыхУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		Если Не Копирование Тогда
			Отказ = истина;
			//открываем форму с парметрами только в случае если не используется копирвоание документа.
			ЗначенияЗаполнения 	= новый Структура("Договор", Объект.Ссылка);
			ПараметрыФормы 		= новый Структура("ЗначенияЗаполнения, ВнешнийВызов", ЗначенияЗаполнения, Истина);
			
			ОткрытьФорму("РегистрСведений.CW_НастройкаЗависмыхУслуг.Форма.ФормаЗаписи", ПараметрыФормы, Этаформа,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	Иначе
		
		Отказ = истина;
		ПоказатьПредупреждение(,"Договор нужно записать!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	КомментарийИзменен = истина;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	//Подсистема.НумерацияДоговоровИПриложений
	CW_НумерацияДоговоровИПриложенийКлиент.ОбновитьНомерОбъкта(ЭтаФорма, "CW_ДоговорыПоГрузоперевозкам", "НомерДоговора");
	//Подсистема.НумерацияДоговоровИПриложений

КонецПроцедуры


//ШаблонДоговоров
&НаКлиенте
Процедура ШаблонДоговораПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ШаблонДоговора) Тогда
		
		ДанныеЗаполнения = новый Структура;
		
		//Подсистема.ДополнительныеХарактиристикиДоговоров
		CW_ДополнительныеХарактиристикиДоговоровСервер.ТребуетсяЗаполнениеДополнительныхХарактеристик(ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ЗаполнитьДополнительныеХарактеристики") Тогда
			ЗаполнитьДополнительныеХарактеристики = ДанныеЗаполнения.ЗаполнитьДополнительныеХарактеристики;
		КонецЕсли;
		//Подсистема.ДополнительныеХарактиристикиДоговоров
		
		Если ЗаполнитьДополнительныеХарактеристики и ДополнительныеХарактеристики.Количество() > 0 Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаСменыШаблона", ЭтотОбъект);
			ПоказатьВопрос(Оповещение,  "Заполнить свойства договора по шаблону?" , Режим, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаСменыШаблона(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	ОткрытьФормуВыбораВариантаЗаполнения();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВариантаЗаполнения(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	ОбработатьВыборВариантаЗаполеннияПараметровНаСервере(Ответ.ВариантПерезаполнить);
	//Подсистема.ДополнительныеХарактиристикиДоговоров  
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПараметрыПоШаблону(Команда)
	
	ОткрытьФормуВыбораВариантаЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВариантаЗаполнения()
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьВыборВариантаЗаполнения", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ВыборВариантаЗаполненияПараметровПоШаблону",,ЭтаФорма,,,,ОписаниеОпвещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
//ШаблонДоговоров


//Подсистема.ОригиналыДокументов
&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ОригиналыПредоставленыПриИзмененииНаСервере();
	
КонецПроцедуры

&Насервере
Процедура ОригиналыПредоставленыПриИзмененииНаСервере()
	
	CW_ОригиналыДокументовСервер.ОригиналыПредоставленыПриИзмененииНаСервере(ЭтаФорма) ;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаНажатие(Элемент, СтандартнаяОбработка)
	
	CW_ОригиналыДокументовКлиент.ОткрытьФормуВводаДаты(ЭтаФорма,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(НоваяДата, Параметры) Экспорт
	
	Если НЕ НоваяДата = Неопределено Тогда
		ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата)
	
	CW_ОригиналыДокументовСервер.ОбработатьИзменениедатыВозвратаОригиналовДокументов(ЭтаФорма, НоваяДата);

КонецПроцедуры
//Подсистема.ОригиналыДокументов


//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура УчетПриложенийДоговораПриИзменении(Элемент) 
	
	Если Не Объект.ИспользуютсяПриложения Тогда
		Объект.УчитыватьПриложенияВДокументах = Ложь;	
	КонецЕсли;
	
	CW_УчетПриложенийДоговоровКлиентСервер.УчетПриложенийПриИзменении(ЭтаФорма);

КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

//Подсистема.ДополнительныеХарактиристикиДоговоров
&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрПриИзменении(Элемент)
	
	ОбработатьИзменениеПараметраНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПараметраНаСервере()
	
	CW_ДополнительныеХарактиристикиДоговоровСервер.ДополнительныеХарактеристикиПараметрПриИзменении(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ПараметрНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные.ОграниченСпискомЗначений Тогда
		ДанныеВыбора = ПолучитьСписокВыбораНаСервере();
		СтандартнаяОбработка = ДанныеВыбора = Неопределено;
	Конецесли;       
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеХарактеристикиПриНачалеРедактированияНаСервере(); 
КонецПроцедуры  

&НаСервере
Процедура ДополнительныеХарактеристикиПриНачалеРедактированияНаСервере()
	CW_ДополнительныеХарактиристикиДоговоровСервер.УстановитьСвязиПараметровВыбора(ЭтаФорма);
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокВыбораНаСервере()
	
	мДоступныеЗначения = CW_ДополнительныеХарактиристикиДоговоровСервер.ПолучитьСписокВыбораПараметра(ЭтаФорма);
	Если мДоступныеЗначения <> Неопределено Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(мДоступныеЗначения);
		
		Возврат СписокВыбора;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДополнительныеХарактеристикиПриИзменении(Элемент)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ДополнительныеХарактеристикиПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьЗаполнениеСвойствДоговора(Результат, Параметры)
	
	CW_ДополнительныеХарактиристикиДоговоровСервер.ЗаполнитьСписокПараметровПоШаблону(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеДополнительныхХарактеристик() 

	ОписаниеОпвещения = новый ОписаниеОповещения("ОбработатьВыборВариантаЗаполеннияпараметров", ЭтотОбъект);
	
	Если ДополнительныеХарактеристики.Количество() = 0 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОпвещения, Истина);
	Иначе
		ОткрытьФорму("ОбщаяФорма.CW_ВыборВариантаЗаполненияПараметровПоШаблону",,ЭтаФорма,,,,ОписаниеОпвещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборВариантаЗаполеннияпараметров(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбработатьВыборВариантаЗаполеннияпараметровНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборВариантаЗаполеннияпараметровНаСервере(Результат)
	
	CW_ДополнительныеХарактиристикиДоговоровСервер.ЗаполнитьСписокПараметровПоШаблону(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ПередНачаломДобавления(Отказ, Копирование);

КонецПроцедуры
//Подсистема.ДополнительныеХарактиристикиДоговоров


//Подсистема.НумерацияДоговоровИПриложений
&НаКлиенте
Процедура УстановитьНовыйНомер(Команда)
	
	CW_НумерацияДоговоровИПриложенийКлиент.ОбновитьНомерОбъкта(ЭтаФорма, "CW_ДоговорыПоГрузоперевозкам", "НомерДоговора");
	
КонецПроцедуры
//Подсистема.НумерацияДоговоровИПриложений

//Подсистема.ГруппыУслугПриложенийИДоговоров
&НаКлиенте
Процедура ГруппыУслугПередУдалением(Элемент, Отказ)
	
	CW_ГруппыУслугКлиент.ПередУдалениемГруппыУслуг(ЭтаФорма,Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	CW_ГруппыУслугКлиент.ПередНачаломДобавленияГруппыУслуг(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяОграниченияПоГруппамУслугПриИзменении(Элемент)
	
	CW_ГруппыУслугКлиент.ИспользуетсяОграниченияПоГруппамУслугПриИзменении(ЭтаФорма);

КонецПроцедуры
//Подсистема.ГруппыУслугПриложенийИДоговоров

//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НадписьСлужебныеДоговораНажатие(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АгентскийДоговорНаЗакупку", Объект.АгентскийДоговорНаЗакупку);
	СтруктураПараметров.Вставить("АгентскийДоговорНаПродажу", Объект.АгентскийДоговорНаПродажу);
	СтруктураПараметров.Вставить("ДоговорДляВыявленияФинансовогоРезультата", Объект.ДоговорДляВыявленияФинансовогоРезультата);
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьИзменениеСлужебныхДоговоров", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_СлужебныеДоговора", СтруктураПараметров, ЭтаФорма,,,, ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСлужебныхДоговоров(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.АгентскийДоговорНаЗакупку <>  Результат.АгентскийДоговорНаЗакупку Тогда
		Объект.АгентскийДоговорНаЗакупку = Результат.АгентскийДоговорНаЗакупку;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Объект.АгентскийДоговорНаПродажу <>  Результат.АгентскийДоговорНаПродажу Тогда
		Объект.АгентскийДоговорНаПродажу = Результат.АгентскийДоговорНаПродажу;
		Модифицированность = Истина;
	КонецЕсли;
	Если Объект.ДоговорДляВыявленияФинансовогоРезультата <>  Результат.ДоговорДляВыявленияФинансовогоРезультата Тогда
		Объект.ДоговорДляВыявленияФинансовогоРезультата = Результат.ДоговорДляВыявленияФинансовогоРезультата;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПриложенияДоговораФайлы" Тогда
		СтандартнаяОбработка = Ложь;
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, ВыбраннаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрупппыУслугИзДоговора(Команда)
	
	Если Объект.Ссылка.Пустая() тогда
		ПоказатьПредупреждение(,"Необходимо записать договор!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаКопированияГруппУслуг", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Группы услуг будут скопированы из выбранного договора. Продолжить?", Режим, 0);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаКопированияГруппУслуг(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПродолжитьКопированиеГруппУслуг",ЭтотОбъект);
	
	ПараметрыФормыВыбора = новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыФормыВыбора.Вставить("МножественыйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьКопированиеГруппУслуг(ВыбранноеЗначение, Параметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьКопированиеГруппУслугВФоне(ВыбранноеЗначение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатКопированияГруппУслуг", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьКопированиеГруппУслугВФоне(ЗначениеКопирования)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Копирование групп услуг договора по грузоперевозоке";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТекущийОбъект", 		Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("ЗначениеКопирования", 	ЗначениеКопирования);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.CW_ХарактеристикиГруппУслуг.СкопироватьДатыОказанияГруппУслуг",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатКопированияГруппУслуг(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Элементы.ГруппыУслуг.Обновить();
		ПоказатьОповещениеПользователя("Группы услуг заполнены");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Группы услуг не скопированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка копирования групп услуг");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриложенияДоговораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Модифицированность или Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать договор!");
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаВеденияБухгалтерскогоУчетаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбИзмененииДатыБухгалтескогоУчета", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Документы до даты начала ведения бухгалтерского учета не будут формировать связанных документов бухгалтерского учета. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбИзмененииДатыБухгалтескогоУчета(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Подсказка = "Введите дату";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыДатыБухгалтескогоУчета", ЭтотОбъект, Параметры);
	ПоказатьВводДаты(Оповещение, ТекущаяДата(), Подсказка, ЧастьДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыДатыБухгалтескогоУчета(НоваяДата, Параметры) Экспорт
	
	Если НоваяДата = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.ДатаНачалаВеденияБухгалтерскогоУчета = НоваяДата;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	// формируем стандартное наименование
	СформироватьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры
